# 2. Дан список:
# ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
# Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками
# (добавить кавычку до и кавычку после элемента списка, являющегося числом)
# и дополнить нулём до двух целочисленных разрядов:
# ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']
#
# Сформировать из обработанного списка строку:
# в "05" часов "17" минут температура воздуха была "+05" градусов
#
# Подумать, какое условие записать, чтобы выявить числа среди элементов списка?
# Как модифицировать это условие для чисел со знаком?
# Примечание: если обособление чисел кавычками не будет получаться - можете вернуться к его реализации позже.
# Главное: дополнить числа до двух разрядов нулём!

spisok = ['в', '5','часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']

for i in spisok:
    if i.isdigit() and len(i) ==1:
        i = i.replace('5','"05"')
    elif i.isdigit() and len(i) ==2:
        i = i.replace('17','"17"')
    elif spisok[-2][1:].isdigit():
        i = i.replace('+5','"+05"')
    print(i,end=' ')

